Repository: kitknox/rootshell
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, ca, cs, da, de, es, fi, fr, he, hu, it, ja, ko, nb, nl, pl, pt_br, pt_pt, ro, sl, sv, uk, vi, zh_hans, zh_hant

source: From %@. Recent scrollback will be transferred and the original tab will close once attached.
ar: من %@. سيتم نقل سجل التمرير الأخير، وسيتم إغلاق علامة التبويب الأصلية بمجرد الإرفاق.
ca: Des de %@. Es transferirà l’historial recent i la pestanya original es tancarà un cop establerta la connexió.
cs: Od %@. Nedávná historie výpisu se přenese a původní karta se po připojení zavře.
da: Fra %@. Den seneste rullehistorik bliver overført, og det oprindelige faneblad lukker, når forbindelsen er oprettet.
de: Von %@. Der jüngste Verlauf wird übertragen und der ursprüngliche Tab wird geschlossen, sobald die Verbindung hergestellt ist.
es: Desde %@. Se transferirá el historial reciente y la pestaña original se cerrará una vez conectada.
fi: Lähteestä %@. Viimeisin vierityshistoria siirretään, ja alkuperäinen välilehti sulkeutuu, kun yhteys on muodostettu.
fr: Depuis %@. L’historique récent sera transféré et l’onglet d’origine se fermera une fois la connexion établie.
he: מאת %@. היסטוריית הגלילה האחרונה תועבר, והכרטיסייה המקורית תיסגר לאחר ההתחברות.
hu: Forrás: %@. A legutóbbi visszagörgetési előzmények átkerülnek, és az eredeti lap a csatlakozás után bezárul.
it: Da %@. La cronologia recente verrà trasferita e il pannello originale si chiuderà una volta stabilita la connessione.
ja: %@から。最近のスクロールバックが転送され、接続が完了すると元のタブが閉じます。
ko: %@에서 전송됨. 최근 스크롤백이 전송되며 연결이 완료되면 원본 탭이 닫힙니다.
nb: Fra %@. Den nyeste rullehistorikken blir overført, og den opprinnelige fanen lukkes når tilkoblingen er opprettet.
nl: Van %@. De recente scrollback wordt overgedragen en het oorspronkelijke tabblad wordt gesloten zodra de verbinding tot stand is gebracht.
pl: Z %@. Ostatnia historia przewijania zostanie przeniesiona, a pierwotna karta zamknie się po połączeniu.
pt_br: De %@. O histórico recente será transferido e a aba original será fechada após a conexão.
pt_pt: De %@. O histórico recente será transferido e o separador original será fechado após a ligação.
ro: De la %@. Istoricul recent va fi transferat, iar fila originală se va închide după conectare.
sl: Iz %@. Nedavna zgodovina pomikanja bo prenesena, izvirni zavihek pa se bo po priklopu zaprl.
sv: Från %@. Den senaste rullningshistoriken överförs och den ursprungliga fliken stängs när anslutningen är upprättad.
uk: Із %@. Недавню історію прокручування буде передано, а вихідну вкладку закрито після під’єднання.
vi: Từ %@. Lịch sử cuộn gần đây sẽ được chuyển và thẻ ban đầu sẽ đóng sau khi kết nối hoàn tất.
zh_hans: 来自%@。最近的回滚记录将被传输，接入完成后原标签页将自动关闭。
zh_hant: 來自%@。最近的捲動記錄將會傳輸，接入完成後原分頁將自動關閉。

source: From jump host %@
ar: من مضيف القفز %@
ca: De l'amfitrió de salt %@
cs: Z jump hostu %@
da: Fra jump host %@
de: Von Jump-Host %@
es: Del host de salto %@
fi: Hyppyisännältä %@
fr: Depuis le Jump Host %@
he: ממארח Jump ‏%@
hu: A(z) %@ Jump gazdagépről
it: Dal jump host %@
ja: ジャンプホスト %@ から
ko: 점프 호스트 %@에서
nb: Fra mellomtjeneren %@
nl: Van Jump Host %@
pl: Z hosta pośredniego %@
pt_br: Do Jump Host %@
pt_pt: Do anfitrião de salto %@
ro: De la Jump Host %@
sl: Od jump gostitelja %@
sv: Från Jump Host %@
uk: Від проміжного хоста %@
vi: Từ Jump Host %@
zh_hans: 来自跳板机 %@
zh_hant: 來自跳板機 %@

source: Full host access via nsenter
ar: وصول كامل للمضيف عبر nsenter
ca: Accés complet a l'amfitrió mitjançant nsenter
cs: Plný přístup k hostiteli přes nsenter
da: Fuld værtsadgang via nsenter
de: Vollständiger Hostzugriff über nsenter
es: Acceso completo al host vía nsenter
fi: Täysi pääsy isäntään nsenter-komennolla
fr: Accès complet à l'hôte via nsenter
he: גישה מלאה למארח דרך nsenter
hu: Teljes hozzáférés a gazdagéphez az nsenter segítségével
it: Accesso completo all'host tramite nsenter
ja: nsenter によるホストへのフルアクセス
ko: nsenter를 통한 전체 호스트 접근
nb: Full vertstilgang via nsenter
nl: Volledige hosttoegang via nsenter
pl: Pełny dostęp do hosta przez nsenter
pt_br: Acesso completo ao host via nsenter
pt_pt: Acesso completo ao anfitrião via nsenter
ro: Acces complet la gazdă prin nsenter
sl: Poln dostop do gostitelja prek nsenter
sv: Full värdåtkomst via nsenter
uk: Повний доступ до хоста через nsenter
vi: Toàn quyền truy cập máy chủ qua nsenter
zh_hans: 通过 nsenter 完全访问主机
zh_hant: 透過 nsenter 完整存取主機

source: Full Moon
ar: بدر
ca: Lluna plena
cs: Úplněk
da: Fuldmåne
de: Vollmond
es: Luna llena
fi: Täysikuu
fr: Pleine lune
he: ירח מלא
hu: Telihold
it: Luna piena
ja: 満月
ko: 보름달
nb: Fullmåne
nl: Volle maan
pl: Pełnia
pt_br: Lua cheia
pt_pt: Lua cheia
ro: Lună plină
sl: Polna luna
sv: Fullmåne
uk: Повний місяць
vi: Trăng tròn
zh_hans: 满月
zh_hant: 滿月

source: Full Performance
ar: الأداء الكامل
ca: Rendiment màxim
cs: Plný výkon
da: Fuld ydeevne
de: Volle Leistung
es: Rendimiento máximo
fi: Täysi suorituskyky
fr: Performances maximales
he: ביצועים מלאים
hu: Teljes teljesítmény
it: Prestazioni massime
ja: フルパフォーマンス
ko: 최대 성능
nb: Full ytelse
nl: Volledige prestaties
pl: Pełna wydajność
pt_br: Desempenho máximo
pt_pt: Desempenho máximo
ro: Performanță maximă
sl: Polna zmogljivost
sv: Full prestanda
uk: Повна продуктивність
vi: Hiệu năng tối đa
zh_hans: 全性能
zh_hant: 全效能

source: Full Quality
ar: جودة كاملة
ca: Qualitat completa
cs: Plná kvalita
da: Fuld kvalitet
de: Volle Qualität
es: Calidad total
fi: Täysi laatu
fr: Qualité maximale
he: איכות מלאה
hu: Teljes minőség
it: Qualità massima
ja: フル画質
ko: 최고 품질
nb: Full kvalitet
nl: Volledige kwaliteit
pl: Pełna jakość
pt_br: Qualidade Total
pt_pt: Qualidade Máxima
ro: Calitate maximă
sl: Polna kakovost
sv: Full kvalitet
uk: Повна якість
vi: Chất lượng đầy đủ
zh_hans: 完整质量
zh_hant: 完整品質

source: Full Screen
ar: ملء الشاشة
ca: Pantalla completa
cs: Celá obrazovka
da: Fuld skærm
de: Vollbild
es: Pantalla completa
fi: Koko näyttö
fr: Plein écran
he: מסך מלא
hu: Teljes képernyő
it: Schermo intero
ja: フルスクリーン
ko: 전체 화면
nb: Fullskjerm
nl: Volledig scherm
pl: Pełny ekran
pt_br: Tela Cheia
pt_pt: Ecrã Inteiro
ro: Ecran complet
sl: Celoten zaslon
sv: Helskärm
uk: На весь екран
vi: Toàn màn hình
zh_hans: 全屏
zh_hant: 全螢幕

source: Full Screen expands this Screen Sharing pane after the connection succeeds. Keyboard Toolbar controls the toolbar above the software keyboard.
ar: يوسّع «ملء الشاشة» جزء مشاركة الشاشة هذا بعد نجاح الاتصال. ويتحكم «شريط أدوات لوحة المفاتيح» في الشريط الظاهر فوق لوحة المفاتيح على الشاشة.
ca: Pantalla completa amplia aquesta subfinestra de Compartir pantalla quan la connexió s'estableix correctament. Barra d'eines del teclat controla la barra d'eines situada sobre el teclat en pantalla.
cs: Celá obrazovka roztáhne tento panel sdílení obrazovky po úspěšném připojení. Panel nástrojů klávesnice ovládá panel nástrojů nad softwarovou klávesnicí.
da: Fuld skærm udvider denne skærmdelingsrude, når forbindelsen er oprettet. Tastaturværktøjslinje styrer værktøjslinjen over skærmtastaturet.
de: Vollbild vergrößert diesen Bildschirmfreigabe-Bereich, nachdem die Verbindung hergestellt wurde. Tastatur-Symbolleiste steuert die Symbolleiste über der Bildschirmtastatur.
es: «Pantalla completa» amplía este panel de Compartir pantalla una vez establecida la conexión. «Barra de herramientas del teclado» controla la barra situada encima del teclado en pantalla.
fi: Koko näyttö laajentaa tämän näytön jakamisen ruudun, kun yhteys on muodostettu. Näppäimistön työkalupalkki hallitsee näppäimistön yläpuolella olevaa työkalupalkkia.
fr: Plein écran agrandit ce volet Partage d'écran une fois la connexion établie. Barre d'outils du clavier contrôle la barre d'outils au-dessus du clavier à l'écran.
he: מסך מלא מרחיב את חלונית שיתוף המסך הזו לאחר שהחיבור מצליח. סרגל הכלים של המקלדת שולט בסרגל הכלים שמעל המקלדת שעל המסך.
hu: A Teljes képernyő a kapcsolat létrejötte után kiterjeszti ezt a képernyőmegosztási panelt. A Billentyűzet eszköztár a szoftveres billentyűzet feletti eszköztárat vezérli.
it: Schermo intero espande questo riquadro di condivisione schermo dopo che la connessione è riuscita. Barra strumenti tastiera controlla la barra sopra la tastiera software.
ja: 「フルスクリーン」は接続成功後にこの画面共有ペインを拡大します。「キーボードツールバー」はソフトウェアキーボードの上に表示されるツールバーを制御します。
ko: 전체 화면은 연결에 성공한 후 이 화면 공유 창을 확대합니다. 키보드 도구 모음은 화면 키보드 위에 표시되는 도구 모음을 제어합니다.
nb: Fullskjerm utvider dette skjermdelingspanelet etter at tilkoblingen er opprettet. Tastaturverktøylinje styrer verktøylinjen over skjermtastaturet.
nl: Volledig scherm vergroot dit Schermdelen-deelvenster nadat de verbinding tot stand is gekomen. Toetsenbordwerkbalk bepaalt de werkbalk boven het schermtoetsenbord.
pl: Pełny ekran rozszerza ten panel udostępniania ekranu po udanym połączeniu. Pasek narzędzi klawiatury steruje paskiem nad klawiaturą ekranową.
pt_br: A Tela Cheia expande este painel de Compartilhamento de Tela após a conexão ser estabelecida. A Barra de Ferramentas do Teclado controla a barra acima do teclado virtual.
pt_pt: Ecrã Inteiro expande este painel de Partilha de Ecrã após a ligação ser estabelecida. Barra de Ferramentas do Teclado controla a barra de ferramentas acima do teclado virtual.
ro: „Ecran complet” extinde acest panou de partajare ecran după reușita conexiunii. „Bara de instrumente a tastaturii” controlează bara de instrumente de deasupra tastaturii virtuale.
sl: Celoten zaslon razširi to podokno skupne rabe zaslona po uspešni povezavi. Orodna vrstica tipkovnice upravlja orodno vrstico nad zaslonsko tipkovnico.
sv: Helskärm expanderar den här skärmdelningsrutan när anslutningen har lyckats. Tangentbordets verktygsfält styr verktygsfältet ovanför skärmtangentbordet.
uk: «Повноекранний режим» розгортає цю область спільного доступу до екрана після успішного з'єднання. «Панель інструментів клавіатури» керує панеллю над екранною клавіатурою.
vi: Toàn màn hình sẽ mở rộng khung Chia sẻ màn hình này sau khi kết nối thành công. Thanh công cụ bàn phím kiểm soát thanh công cụ phía trên bàn phím ảo.
zh_hans: “全屏”会在连接成功后展开此屏幕共享窗格。“键盘工具栏”控制软件键盘上方的工具栏。
zh_hant: 「全螢幕」會在連線成功後展開此螢幕共享窗格。「鍵盤工具列」用於控制螢幕鍵盤上方的工具列。

source: Full-featured text editor
ar: محرر نصوص كامل المزايا
ca: Editor de text complet
cs: Plnohodnotný textový editor
da: Fuldgyldig teksteditor
de: Voll ausgestatteter Texteditor
es: Editor de texto completo
fi: Monipuolinen tekstieditori
fr: Éditeur de texte complet
he: עורך טקסט מלא
hu: Teljes funkcionalitású szövegszerkesztő
it: Editor di testo completo
ja: 高機能テキストエディタ
ko: 완전한 기능의 텍스트 편집기
nb: Fullverdig tekstredigerer
nl: Volledig uitgeruste teksteditor
pl: Pełnofunkcyjny edytor tekstu
pt_br: Editor de texto completo
pt_pt: Editor de texto completo
ro: Editor de text complet
sl: Polno opremljen urejevalnik besedil
sv: Fullfjädrad textredigerare
uk: Повнофункціональний текстовий редактор
vi: Trình soạn thảo văn bản đầy đủ tính năng
zh_hans: 功能齐全的文本编辑器
zh_hant: 功能完整的文字編輯器

source: Garden
ar: حديقة
ca: Jardí
cs: Zahrada
da: Have
de: Garten
es: Jardín
fi: Puutarha
fr: Jardin
he: גן
hu: Kert
it: Giardino
ja: ガーデン
ko: 정원
nb: Hage
nl: Tuin
pl: Ogród
pt_br: Jardim
pt_pt: Jardim
ro: Grădină
sl: Vrt
sv: Trädgård
uk: Сад
vi: Khu Vườn
zh_hans: 花园
zh_hant: 花園

source: Gateway
ar: البوابة
ca: Passarel·la
cs: Brána
es: Pasarela
fi: Yhdyskäytävä
fr: Passerelle
he: שער
hu: Átjáró
ja: ゲートウェイ
ko: 게이트웨이
pl: Brama
sl: Prehod
uk: Шлюз
vi: Cổng
zh_hans: 网关
zh_hant: 閘道

source: Gateway %@
ar: البوابة %@
ca: Passarel·la %@
cs: Brána %@
es: Pasarela %@
fi: Yhdyskäytävä %@
fr: Passerelle %@
he: שער %@
hu: Átjáró %@
ja: ゲートウェイ %@
ko: 게이트웨이 %@
pl: Brama %@
sl: Prehod %@
uk: Шлюз %@
vi: Cổng %@
zh_hans: 网关 %@
zh_hant: 閘道 %@

source: Generate
ar: إنشاء
ca: Generar
cs: Vygenerovat
da: Generer
de: Generieren
es: Generar
fi: Luo
fr: Générer
he: צור
hu: Generálás
it: Genera
ja: 生成
ko: 생성
nb: Generer
nl: Genereren
pl: Generuj
pt_br: Gerar
pt_pt: Gerar
ro: Generează
sl: Generiraj
sv: Generera
uk: Згенерувати
vi: Tạo
zh_hans: 生成
zh_hant: 產生

source: Generate an ASCII-armored OpenPGP public key block so the remote can `gpg --import` it. Without this, forwarded GPG signing requests have no key to sign with on the remote side. The keygrip above is what we tell the remote `gpg-agent` we can sign for. It MUST match the output of `gpg --with-keygrip --list-keys <fingerprint>` on the remote after import; a mismatch means `gpg` won't recognize the agent-held secret.
ar: أنشئ كتلة مفتاح OpenPGP عام بترميز ASCII حتى يتمكن الجهاز البعيد من استيرادها عبر `gpg --import`. بدون هذا، لن يكون لطلبات التوقيع GPG الموجَّهة مفتاح للتوقيع به على الجانب البعيد. الـ keygrip أعلاه هو ما نخبر به `gpg-agent` البعيد أننا قادرون على التوقيع به. يجب أن يطابق ناتج `gpg --with-keygrip --list-keys <fingerprint>` على الجهاز البعيد بعد الاستيراد؛ عدم التطابق يعني أن `gpg` لن يتعرف على السر الموجود في الوكيل.
ca: Genera un bloc de clau pública OpenPGP en ASCII per tal que el remot el pugui importar amb `gpg --import`. Sense això, les sol·licituds de signatura GPG reenviades no tenen cap clau amb què signar al costat remot. El keygrip de dalt és el que indiquem al `gpg-agent` remot que podem signar. HA de coincidir amb la sortida de `gpg --with-keygrip --list-keys <fingerprint>` al remot després de la importació; una discrepància significa que `gpg` no reconeixerà el secret que té l'agent.
cs: Vygeneruje blok veřejného klíče OpenPGP v ASCII formátu, aby ho mohl vzdálený stroj naimportovat pomocí `gpg --import`. Bez něj nemají přesměrované požadavky na GPG podpis na vzdálené straně žádný klíč k podepsání. Keygrip výše je to, co sdělujeme vzdálenému `gpg-agentovi`, že umíme podepsat. MUSÍ odpovídat výstupu `gpg --with-keygrip --list-keys <fingerprint>` na vzdáleném stroji po importu; nesoulad znamená, že `gpg` nerozpozná tajný klíč držený agentem.
da: Generér en ASCII-armoreret OpenPGP-blok med en offentlig nøgle, så fjernsystemet kan importere den med `gpg --import`. Uden den har videresendte GPG-signeringsanmodninger ingen nøgle at signere med på fjernsiden. Keygrip'en ovenfor er det, vi fortæller den eksterne `gpg-agent`, at vi kan signere for. Den SKAL svare til outputtet af `gpg --with-keygrip --list-keys <fingerprint>` på fjernsystemet efter import; et mismatch betyder, at `gpg` ikke vil genkende hemmeligheden, som agenten holder.
de: Erzeugen Sie einen ASCII-armored OpenPGP-Block des öffentlichen Schlüssels, damit die Gegenstelle ihn per `gpg --import` importieren kann. Ohne ihn fehlt weitergeleiteten GPG-Signaturanforderungen auf der Gegenseite jeglicher Schlüssel zum Signieren. Die obige keygrip ist das, womit wir dem entfernten `gpg-agent` mitteilen, wofür wir signieren können. Sie MUSS mit der Ausgabe von `gpg --with-keygrip --list-keys <fingerprint>` auf der Gegenstelle nach dem Import übereinstimmen; bei Abweichung erkennt `gpg` das vom Agenten gehaltene Geheimnis nicht.
es: Genere un bloque de clave pública OpenPGP en formato ASCII-armored para que el remoto pueda importarlo con `gpg --import`. Sin esto, las solicitudes de firma GPG reenviadas no tienen clave con la que firmar en el lado remoto. El keygrip de arriba es lo que le decimos al `gpg-agent` remoto que podemos firmar. DEBE coincidir con la salida de `gpg --with-keygrip --list-keys <fingerprint>` en el remoto tras la importación; una discrepancia significa que `gpg` no reconocerá el secreto en poder del agente.
fi: Luo ASCII-armored OpenPGP-julkisen avaimen lohko, jotta etäkone voi tuoda sen komennolla `gpg --import`. Ilman tätä välitetyillä GPG-allekirjoituspyynnöillä ei ole avainta, jolla allekirjoittaa etäpäässä. Yllä oleva keygrip on se, mitä kerromme etäkoneen `gpg-agent`ille voivamme allekirjoittaa. Sen on TÄYSMÄÄN vastattava etäkoneen `gpg --with-keygrip --list-keys <fingerprint>` -komennon tulostetta tuonnin jälkeen; ristiriita tarkoittaa, että `gpg` ei tunnista agentin hallussa olevaa salaisuutta.
fr: Générez un bloc de clé publique OpenPGP en ASCII-armored pour que la machine distante puisse l'importer avec `gpg --import`. Sans cela, les demandes de signature GPG transférées n'ont aucune clé pour signer du côté distant. Le keygrip ci-dessus est ce que nous indiquons au `gpg-agent` distant comme étant signable. Il DOIT correspondre à la sortie de `gpg --with-keygrip --list-keys <fingerprint>` sur la machine distante après l'import ; une non-correspondance signifie que `gpg` ne reconnaîtra pas le secret détenu par l'agent.
he: צור בלוק מפתח ציבורי OpenPGP מקודד ASCII-armored כדי שהמארח המרוחק יוכל לבצע `gpg --import`. ללא זה, לבקשות חתימה GPG מועברות אין מפתח לחתום איתו בצד המרוחק. ה-keygrip שלמעלה הוא מה שאנו מדווחים ל-`gpg-agent` המרוחק שאנו יכולים לחתום עבורו. הוא חייב להתאים לפלט של `gpg --with-keygrip --list-keys <fingerprint>` במארח המרוחק לאחר הייבוא; חוסר התאמה משמעו ש-`gpg` לא יזהה את הסוד שמוחזק על ידי הסוכן.
hu: Generáljon egy ASCII-armored OpenPGP nyilvános kulcs blokkot, hogy a távoli gép `gpg --import` paranccsal beimportálhassa. Enélkül a továbbított GPG aláírási kéréseknek nincs kulcsuk, amellyel aláírhatnának a távoli oldalon. A fenti keygrip az, amit közlünk a távoli `gpg-agent`-nek, hogy alá tudunk írni vele. KÖTELEZŐEN meg kell egyeznie a távoli gépen futtatott `gpg --with-keygrip --list-keys <fingerprint>` parancs kimenetével az importálás után; az eltérés azt jelenti, hogy a `gpg` nem ismeri fel az ügynök által tartott titkos kulcsot.
it: Genera un blocco di chiave pubblica OpenPGP in formato ASCII-armored in modo che il remoto possa eseguire `gpg --import`. Senza di esso, le richieste di firma GPG inoltrate non hanno alcuna chiave con cui firmare sul lato remoto. Il keygrip sopra è ciò che comunichiamo al `gpg-agent` remoto come capacità di firma. DEVE corrispondere all'output di `gpg --with-keygrip --list-keys <fingerprint>` sul remoto dopo l'importazione; una discrepanza significa che `gpg` non riconoscerà il segreto detenuto dall'agente.
ja: リモートが`gpg --import`できるよう、ASCII-armored形式のOpenPGP公開鍵ブロックを生成します。これがないと、転送されたGPG署名リクエストはリモート側で署名するキーがありません。 上記のkeygripは、リモートの`gpg-agent`に対して署名可能なものとして伝える値です。インポート後にリモートで実行する`gpg --with-keygrip --list-keys <fingerprint>`の出力と一致する必要があります。一致しない場合、`gpg`はエージェント保持の秘密を認識しません。
ko: 원격에서 `gpg --import`할 수 있도록 ASCII-armored OpenPGP 공개 키 블록을 생성합니다. 이것이 없으면 전달된 GPG 서명 요청은 원격 측에서 서명할 키가 없습니다. 위의 keygrip은 원격 `gpg-agent`에 서명할 수 있다고 알리는 값입니다. 가져오기 후 원격에서 실행한 `gpg --with-keygrip --list-keys <fingerprint>`의 출력과 일치해야 합니다. 일치하지 않으면 `gpg`는 에이전트가 보유한 비밀을 인식하지 못합니다.
nb: Genererer en ASCII-armored OpenPGP-offentlig nøkkelblokk slik at fjernverten kan kjøre `gpg --import`. Uten dette har videresendte GPG-signeringsforespørsler ingen nøkkel å signere med på fjernsiden. Keygripen ovenfor er det vi forteller den eksterne `gpg-agent` at vi kan signere for. Den MÅ samsvare med utdata fra `gpg --with-keygrip --list-keys <fingerprint>` på fjernverten etter import; et avvik betyr at `gpg` ikke vil gjenkjenne agent-holdt hemmelighet.
nl: Genereert een ASCII-armored OpenPGP-publieke sleutelblok zodat de externe host het kan `gpg --import`-en. Zonder dit hebben doorgestuurde GPG-ondertekeningsverzoeken geen sleutel om mee te ondertekenen aan de externe kant. De keygrip hierboven is wat we de externe `gpg-agent` vertellen dat we voor kunnen ondertekenen. Deze MOET overeenkomen met de uitvoer van `gpg --with-keygrip --list-keys <fingerprint>` op de externe host na het importeren; een mismatch betekent dat `gpg` het door de agent gehouden geheim niet zal herkennen.
pl: Wygeneruj blok klucza publicznego OpenPGP w formacie ASCII-armored, aby zdalny host mógł go zaimportować poleceniem `gpg --import`. Bez tego przekierowane żądania podpisywania GPG nie mają klucza do podpisu po stronie zdalnej. Powyższy keygrip mówi zdalnemu `gpg-agent`, dla którego klucza możemy podpisywać. MUSI on odpowiadać wynikowi `gpg --with-keygrip --list-keys <fingerprint>` na zdalnym hoście po imporcie; niezgodność oznacza, że `gpg` nie rozpozna sekretu trzymanego przez agenta.
pt_br: Gere um bloco de chave pública OpenPGP em ASCII-armored para que o remoto possa importá-lo com `gpg --import`. Sem isso, as solicitações de assinatura GPG encaminhadas não têm chave para assinar no lado remoto. O keygrip acima é o que dizemos ao `gpg-agent` remoto que podemos assinar. Ele DEVE corresponder à saída de `gpg --with-keygrip --list-keys <fingerprint>` no remoto após a importação; uma incompatibilidade significa que o `gpg` não reconhecerá o segredo mantido pelo agente.
pt_pt: Gere um bloco de chave pública OpenPGP em ASCII-armored para que o remoto possa importá-lo com `gpg --import`. Sem isso, os pedidos de assinatura GPG reencaminhados não têm chave para assinar no lado remoto. O keygrip acima é o que dizemos ao `gpg-agent` remoto que podemos assinar. TEM de corresponder à saída de `gpg --with-keygrip --list-keys <fingerprint>` no remoto após a importação; uma incompatibilidade significa que o `gpg` não irá reconhecer o segredo mantido pelo agente.
ro: Generează un bloc de cheie publică OpenPGP în format ASCII-armored, astfel încât sistemul la distanță să-l poată importa cu `gpg --import`. Fără acesta, cererile de semnare GPG redirecționate nu au cu ce să semneze pe partea remotă. Keygrip-ul de mai sus este ceea ce comunicăm `gpg-agent`-ului remot că putem semna. TREBUIE să corespundă rezultatului `gpg --with-keygrip --list-keys <fingerprint>` pe sistemul la distanță după import; o nepotrivire înseamnă că `gpg` nu va recunoaște secretul deținut de agent.
sl: Ustvarite blok javnega ključa OpenPGP v formatu ASCII-armored, da ga lahko oddaljeni gostitelj uvozi z `gpg --import`. Brez tega posredovane zahteve za podpisovanje GPG na oddaljeni strani nimajo ključa za podpis. Zgornji keygrip je tisto, kar oddaljenemu `gpg-agent` sporočimo, da lahko zanj podpisujemo. MORA se ujemati z izpisom `gpg --with-keygrip --list-keys <fingerprint>` na oddaljenem gostitelju po uvozu; neujemanje pomeni, da `gpg` ne bo prepoznal skrivnosti, ki jo hrani agent.
sv: Generera ett ASCII-armored OpenPGP-publik nyckelblock så att fjärren kan göra `gpg --import` på det. Utan detta har vidarebefordrade GPG-signeringsförfrågningar ingen nyckel att signera med på fjärrsidan. Keygrip ovan är vad vi talar om för den fjärranslutna `gpg-agent` att vi kan signera för. Den MÅSTE matcha utdata från `gpg --with-keygrip --list-keys <fingerprint>` på fjärren efter importen; en obalans innebär att `gpg` inte känner igen den agentinnehavda hemligheten.
uk: Згенеруйте ASCII-armored блок відкритого ключа OpenPGP, щоб віддалена сторона могла виконати `gpg --import`. Без цього переадресовані запити на підпис GPG не матимуть ключа для підписування на віддаленій стороні. Keygrip вище — це те, що ми повідомляємо віддаленому `gpg-agent`, для якого можемо підписувати. Він МУСИТЬ збігатися з результатом `gpg --with-keygrip --list-keys <fingerprint>` на віддаленій стороні після імпорту; розбіжність означає, що `gpg` не розпізнає секрет, що зберігається в агенті.
vi: Tạo một khối khóa công khai OpenPGP dạng ASCII-armored để máy từ xa có thể `gpg --import` nó. Nếu không có, các yêu cầu ký GPG được chuyển tiếp sẽ không có khóa nào để ký ở phía máy từ xa. Keygrip ở trên là thứ chúng ta cho `gpg-agent` từ xa biết rằng chúng ta có thể ký cho nó. Nó BẮT BUỘC phải khớp với đầu ra của `gpg --with-keygrip --list-keys <fingerprint>` trên máy từ xa sau khi nhập; nếu không khớp, `gpg` sẽ không nhận ra khóa bí mật do agent giữ.
zh_hans: 生成一个 ASCII-armored OpenPGP 公钥块，以便远程可以使用 `gpg --import` 导入。否则，转发的 GPG 签名请求在远程侧没有可用于签名的密钥。 上面的 keygrip 是我们告诉远程 `gpg-agent` 可以为其签名的标识。它必须与导入后远程上 `gpg --with-keygrip --list-keys <fingerprint>` 的输出相匹配；不匹配意味着 `gpg` 将无法识别由代理持有的私钥。
zh_hant: 產生一個 ASCII-armored OpenPGP 公鑰區塊，讓遠端能透過 `gpg --import` 匯入。若沒有此區塊，轉發的 GPG 簽署請求在遠端就沒有金鑰可用來簽署。 上方的 keygrip 是我們告知遠端 `gpg-agent` 可代為簽署的識別。它必須與匯入後遠端 `gpg --with-keygrip --list-keys <fingerprint>` 的輸出相符；不符就表示 `gpg` 無法辨識代理持有的私鑰。
